program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.4.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios17>(tensor<int32, [1]> audio_length, tensor<fp32, [1, 128, 129]> audio_signal, tensor<fp32, [17, 1, 70, 512]> cache_last_channel, tensor<int32, [1]> cache_last_channel_len, tensor<fp32, [17, 1, 512, 8]> cache_last_time, tensor<fp32, [1, 128, 16]> pre_cache) {
            tensor<int32, []> var_9 = const()[name = tensor<string, []>("op_9"), val = tensor<int32, []>(2)];
            tensor<bool, []> full_input_interleave_0 = const()[name = tensor<string, []>("full_input_interleave_0"), val = tensor<bool, []>(false)];
            tensor<string, []> pre_cache_to_fp16_dtype_0 = const()[name = tensor<string, []>("pre_cache_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> audio_signal_to_fp16_dtype_0 = const()[name = tensor<string, []>("audio_signal_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 128, 129]> audio_signal_to_fp16 = cast(dtype = audio_signal_to_fp16_dtype_0, x = audio_signal)[name = tensor<string, []>("cast_193")];
            tensor<fp16, [1, 128, 16]> pre_cache_to_fp16 = cast(dtype = pre_cache_to_fp16_dtype_0, x = pre_cache)[name = tensor<string, []>("cast_194")];
            tensor<fp16, [1, 128, 145]> full_input_cast_fp16 = concat(axis = var_9, interleave = full_input_interleave_0, values = (pre_cache_to_fp16, audio_signal_to_fp16))[name = tensor<string, []>("full_input_cast_fp16")];
            tensor<int32, []> var_12 = const()[name = tensor<string, []>("op_12"), val = tensor<int32, []>(16)];
            tensor<int32, [1]> value_1 = add(x = audio_length, y = var_12)[name = tensor<string, []>("value_1")];
            tensor<int32, [3]> var_28_begin_0 = const()[name = tensor<string, []>("op_28_begin_0"), val = tensor<int32, [3]>([0, 0, 129])];
            tensor<int32, [3]> var_28_end_0 = const()[name = tensor<string, []>("op_28_end_0"), val = tensor<int32, [3]>([1, 128, 145])];
            tensor<bool, [3]> var_28_end_mask_0 = const()[name = tensor<string, []>("op_28_end_mask_0"), val = tensor<bool, [3]>([true, true, true])];
            tensor<fp16, [1, 128, 16]> var_28_cast_fp16 = slice_by_index(begin = var_28_begin_0, end = var_28_end_0, end_mask = var_28_end_mask_0, x = full_input_cast_fp16)[name = tensor<string, []>("op_28_cast_fp16")];
            tensor<string, []> var_28_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("op_28_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<int32, []> var_62 = const()[name = tensor<string, []>("op_62"), val = tensor<int32, []>(-1)];
            tensor<int32, []> var_64 = const()[name = tensor<string, []>("op_64"), val = tensor<int32, []>(1)];
            tensor<int32, [3]> x_1_perm_0 = const()[name = tensor<string, []>("x_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<string, []> cast_0_to_fp16_dtype_0 = const()[name = tensor<string, []>("cast_0_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, []> _inversed_108_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_108_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-1)];
            tensor<fp16, [1]> value_1_to_fp16 = cast(dtype = cast_0_to_fp16_dtype_0, x = value_1)[name = tensor<string, []>("cast_191")];
            tensor<fp16, [1]> _inversed_108_cast_fp16 = mul(x = value_1_to_fp16, y = _inversed_108_y_0_to_fp16)[name = tensor<string, []>("_inversed_108_cast_fp16")];
            tensor<fp16, []> var_109_to_fp16 = const()[name = tensor<string, []>("op_109_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1]> lengths_1_cast_fp16 = add(x = _inversed_108_cast_fp16, y = var_109_to_fp16)[name = tensor<string, []>("lengths_1_cast_fp16")];
            tensor<fp16, [1]> lengths_3_cast_fp16 = floor(x = lengths_1_cast_fp16)[name = tensor<string, []>("lengths_3_cast_fp16")];
            tensor<fp16, []> _inversed_116_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_116_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-1)];
            tensor<fp16, [1]> _inversed_116_cast_fp16 = mul(x = lengths_3_cast_fp16, y = _inversed_116_y_0_to_fp16)[name = tensor<string, []>("_inversed_116_cast_fp16")];
            tensor<fp16, []> var_117_to_fp16 = const()[name = tensor<string, []>("op_117_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1]> lengths_7_cast_fp16 = add(x = _inversed_116_cast_fp16, y = var_117_to_fp16)[name = tensor<string, []>("lengths_7_cast_fp16")];
            tensor<fp16, [1]> lengths_9_cast_fp16 = floor(x = lengths_7_cast_fp16)[name = tensor<string, []>("lengths_9_cast_fp16")];
            tensor<fp16, []> _inversed_124_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_124_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-1)];
            tensor<fp16, [1]> _inversed_124_cast_fp16 = mul(x = lengths_9_cast_fp16, y = _inversed_124_y_0_to_fp16)[name = tensor<string, []>("_inversed_124_cast_fp16")];
            tensor<fp16, []> var_125_to_fp16 = const()[name = tensor<string, []>("op_125_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1]> lengths_13_cast_fp16 = add(x = _inversed_124_cast_fp16, y = var_125_to_fp16)[name = tensor<string, []>("lengths_13_cast_fp16")];
            tensor<fp16, [1]> lengths_cast_fp16 = floor(x = lengths_13_cast_fp16)[name = tensor<string, []>("lengths_cast_fp16")];
            tensor<string, []> cast_9_dtype_0 = const()[name = tensor<string, []>("cast_9_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 145, 128]> x_1_cast_fp16 = transpose(perm = x_1_perm_0, x = full_input_cast_fp16)[name = tensor<string, []>("transpose_241")];
            tensor<fp16, [1, 1, 145, 128]> input_1_cast_fp16 = expand_dims(axes = input_1_axes_0, x = x_1_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [8]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 2, 1, 2, 1])];
            tensor<string, []> input_3_mode_0 = const()[name = tensor<string, []>("input_3_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 1, 148, 131]> input_3_cast_fp16 = pad(constant_val = const_0_to_fp16, mode = input_3_mode_0, pad = input_3_pad_0, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_5_strides_0 = const()[name = tensor<string, []>("input_5_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_5_dilations_0 = const()[name = tensor<string, []>("input_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_5_groups_0 = const()[name = tensor<string, []>("input_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 1, 3, 3]> encoder_pre_encode_conv_0_weight_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_0_weight_to_fp16"), val = tensor<fp16, [256, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [256]> encoder_pre_encode_conv_0_bias_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_0_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4736)))];
            tensor<fp16, [1, 256, 73, 65]> input_5_cast_fp16 = conv(bias = encoder_pre_encode_conv_0_bias_to_fp16, dilations = input_5_dilations_0, groups = input_5_groups_0, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = input_5_strides_0, weight = encoder_pre_encode_conv_0_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [1, 256, 73, 65]> input_7_cast_fp16 = relu(x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [8]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 2, 1, 2, 1])];
            tensor<string, []> input_9_mode_0 = const()[name = tensor<string, []>("input_9_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 256, 76, 68]> input_9_cast_fp16 = pad(constant_val = const_1_to_fp16, mode = input_9_mode_0, pad = input_9_pad_0, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(256)];
            tensor<int32, [4]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [256, 1, 3, 3]> encoder_pre_encode_conv_2_weight_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_2_weight_to_fp16"), val = tensor<fp16, [256, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5312)))];
            tensor<fp16, [256]> encoder_pre_encode_conv_2_bias_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9984)))];
            tensor<fp16, [1, 256, 37, 33]> input_11_cast_fp16 = conv(bias = encoder_pre_encode_conv_2_bias_to_fp16, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = encoder_pre_encode_conv_2_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 1, 1]> encoder_pre_encode_conv_3_weight_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_3_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10560)))];
            tensor<fp16, [256]> encoder_pre_encode_conv_3_bias_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_3_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141696)))];
            tensor<fp16, [1, 256, 37, 33]> input_13_cast_fp16 = conv(bias = encoder_pre_encode_conv_3_bias_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = encoder_pre_encode_conv_3_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1, 256, 37, 33]> input_15_cast_fp16 = relu(x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [8]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 2, 1, 2, 1])];
            tensor<string, []> input_17_mode_0 = const()[name = tensor<string, []>("input_17_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 256, 40, 36]> input_17_cast_fp16 = pad(constant_val = const_2_to_fp16, mode = input_17_mode_0, pad = input_17_pad_0, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_19_strides_0 = const()[name = tensor<string, []>("input_19_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> input_19_groups_0 = const()[name = tensor<string, []>("input_19_groups_0"), val = tensor<int32, []>(256)];
            tensor<int32, [4]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_19_dilations_0 = const()[name = tensor<string, []>("input_19_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [256, 1, 3, 3]> encoder_pre_encode_conv_5_weight_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_5_weight_to_fp16"), val = tensor<fp16, [256, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142272)))];
            tensor<fp16, [256]> encoder_pre_encode_conv_5_bias_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_5_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(146944)))];
            tensor<fp16, [1, 256, 19, 17]> input_19_cast_fp16 = conv(bias = encoder_pre_encode_conv_5_bias_to_fp16, dilations = input_19_dilations_0, groups = input_19_groups_0, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = input_19_strides_0, weight = encoder_pre_encode_conv_5_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 1, 1]> encoder_pre_encode_conv_6_weight_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_6_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(147520)))];
            tensor<fp16, [256]> encoder_pre_encode_conv_6_bias_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_conv_6_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(278656)))];
            tensor<fp16, [1, 256, 19, 17]> input_21_cast_fp16 = conv(bias = encoder_pre_encode_conv_6_bias_to_fp16, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = encoder_pre_encode_conv_6_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1, 256, 19, 17]> x_3_cast_fp16 = relu(x = input_21_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [4]> var_181_perm_0 = const()[name = tensor<string, []>("op_181_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_182 = const()[name = tensor<string, []>("op_182"), val = tensor<int32, [3]>([1, 19, -1])];
            tensor<fp16, [1, 19, 256, 17]> var_181_cast_fp16 = transpose(perm = var_181_perm_0, x = x_3_cast_fp16)[name = tensor<string, []>("transpose_240")];
            tensor<fp16, [1, 19, 4352]> input_23_cast_fp16 = reshape(shape = var_182, x = var_181_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [512, 4352]> encoder_pre_encode_out_weight_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_out_weight_to_fp16"), val = tensor<fp16, [512, 4352]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(279232)))];
            tensor<fp16, [512]> encoder_pre_encode_out_bias_to_fp16 = const()[name = tensor<string, []>("encoder_pre_encode_out_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4735744)))];
            tensor<fp16, [1, 19, 512]> linear_0_cast_fp16 = linear(bias = encoder_pre_encode_out_bias_to_fp16, weight = encoder_pre_encode_out_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [3]> var_192_begin_0 = const()[name = tensor<string, []>("op_192_begin_0"), val = tensor<int32, [3]>([0, 2, 0])];
            tensor<int32, [3]> var_192_end_0 = const()[name = tensor<string, []>("op_192_end_0"), val = tensor<int32, [3]>([1, 19, 512])];
            tensor<bool, [3]> var_192_end_mask_0 = const()[name = tensor<string, []>("op_192_end_mask_0"), val = tensor<bool, [3]>([true, true, true])];
            tensor<fp16, [1, 17, 512]> var_192_cast_fp16 = slice_by_index(begin = var_192_begin_0, end = var_192_end_0, end_mask = var_192_end_mask_0, x = linear_0_cast_fp16)[name = tensor<string, []>("op_192_cast_fp16")];
            tensor<int32, []> var_194 = const()[name = tensor<string, []>("op_194"), val = tensor<int32, []>(2)];
            tensor<int32, [1]> lengths_cast_fp16_to_int32 = cast(dtype = cast_9_dtype_0, x = lengths_cast_fp16)[name = tensor<string, []>("cast_190")];
            tensor<int32, [1]> var_195 = sub(x = lengths_cast_fp16_to_int32, y = var_194)[name = tensor<string, []>("op_195")];
            tensor<string, []> var_195_promoted_to_fp16_dtype_0 = const()[name = tensor<string, []>("op_195_promoted_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, []> var_60_promoted_to_fp16 = const()[name = tensor<string, []>("op_60_promoted_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> const_5_to_fp16 = const()[name = tensor<string, []>("const_5_to_fp16"), val = tensor<fp16, []>(inf)];
            tensor<fp16, [1]> var_195_to_fp16 = cast(dtype = var_195_promoted_to_fp16_dtype_0, x = var_195)[name = tensor<string, []>("cast_189")];
            tensor<fp16, [1]> clip_0_cast_fp16 = clip(alpha = var_60_promoted_to_fp16, beta = const_5_to_fp16, x = var_195_to_fp16)[name = tensor<string, []>("clip_0_cast_fp16")];
            tensor<int32, [1]> max_audio_length_1 = const()[name = tensor<string, []>("max_audio_length_1"), val = tensor<int32, [1]>([17])];
            tensor<fp16, []> var_211_promoted_to_fp16 = const()[name = tensor<string, []>("op_211_promoted_to_fp16"), val = tensor<fp16, []>(0x1.18p+6)];
            tensor<fp16, [1]> padding_length_cast_fp16 = add(x = clip_0_cast_fp16, y = var_211_promoted_to_fp16)[name = tensor<string, []>("padding_length_cast_fp16")];
            tensor<int32, []> const_7 = const()[name = tensor<string, []>("const_7"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_213 = mul(x = cache_last_channel_len, y = const_7)[name = tensor<string, []>("op_213")];
            tensor<int32, []> var_214 = const()[name = tensor<string, []>("op_214"), val = tensor<int32, []>(70)];
            tensor<int32, [1]> offset = add(x = var_213, y = var_214)[name = tensor<string, []>("offset")];
            tensor<int32, [1]> var_254_axes_0 = const()[name = tensor<string, []>("op_254_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 1]> var_254_cast_fp16 = expand_dims(axes = var_254_axes_0, x = padding_length_cast_fp16)[name = tensor<string, []>("op_254_cast_fp16")];
            tensor<fp16, [1, 87]> var_253_promoted_to_fp16 = const()[name = tensor<string, []>("op_253_promoted_to_fp16"), val = tensor<fp16, [1, 87]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4736832)))];
            tensor<bool, [1, 87]> pad_mask_1_cast_fp16 = less(x = var_253_promoted_to_fp16, y = var_254_cast_fp16)[name = tensor<string, []>("pad_mask_1_cast_fp16")];
            tensor<int32, [1, 87]> expand_dims_1 = const()[name = tensor<string, []>("expand_dims_1"), val = tensor<int32, [1, 87]>([[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86]])];
            tensor<int32, [1]> var_260_axes_0 = const()[name = tensor<string, []>("op_260_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<int32, [1, 1]> var_260 = expand_dims(axes = var_260_axes_0, x = offset)[name = tensor<string, []>("op_260")];
            tensor<bool, [1, 87]> pad_mask_off = greater_equal(x = expand_dims_1, y = var_260)[name = tensor<string, []>("pad_mask_off")];
            tensor<bool, [1, 87]> pad_mask_3 = logical_and(x = pad_mask_off, y = pad_mask_1_cast_fp16)[name = tensor<string, []>("pad_mask_3")];
            tensor<int32, [1]> var_263_axes_0 = const()[name = tensor<string, []>("op_263_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<bool, [1, 1, 87]> var_263 = expand_dims(axes = var_263_axes_0, x = pad_mask_3)[name = tensor<string, []>("op_263")];
            tensor<int32, [3]> var_264 = const()[name = tensor<string, []>("op_264"), val = tensor<int32, [3]>([1, 87, 1])];
            tensor<bool, [1, 87, 87]> pad_mask_for_att_mask_1 = tile(reps = var_264, x = var_263)[name = tensor<string, []>("pad_mask_for_att_mask_1")];
            tensor<int32, [3]> var_266_perm_0 = const()[name = tensor<string, []>("op_266_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, [1, 87, 87]> var_266 = transpose(perm = var_266_perm_0, x = pad_mask_for_att_mask_1)[name = tensor<string, []>("transpose_239")];
            tensor<bool, [1, 87, 87]> pad_mask_for_att_mask = logical_and(x = pad_mask_for_att_mask_1, y = var_266)[name = tensor<string, []>("pad_mask_for_att_mask")];
            tensor<bool, [1, 87, 87]> const_15 = const()[name = tensor<string, []>("const_15"), val = tensor<bool, [1, 87, 87]>([[[true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], [true, true, true, true, true, true, true, true, true, true, true, 