{
  "0": "<unk>",
  "1": "▁t",
  "2": "▁th",
  "3": "▁a",
  "4": "▁i",
  "5": "▁the",
  "6": "▁s",
  "7": "re",
  "8": "▁w",
  "9": "▁o",
  "10": "in",
  "11": "at",
  "12": "er",
  "13": "nd",
  "14": "ou",
  "15": "▁c",
  "16": "▁b",
  "17": "▁h",
  "18": "en",
  "19": "on",
  "20": "▁m",
  "21": "▁f",
  "22": "ing",
  "23": "▁p",
  "24": "▁to",
  "25": "▁and",
  "26": "▁d",
  "27": "an",
  "28": "or",
  "29": "es",
  "30": "▁y",
  "31": "▁l",
  "32": "▁of",
  "33": "ll",
  "34": "▁in",
  "35": "ed",
  "36": "it",
  "37": "▁g",
  "38": "is",
  "39": "▁you",
  "40": "▁n",
  "41": "ar",
  "42": "om",
  "43": "as",
  "44": "ve",
  "45": "▁e",
  "46": "ic",
  "47": "▁it",
  "48": "al",
  "49": "us",
  "50": "▁wh",
  "51": "▁we",
  "52": "▁be",
  "53": "ion",
  "54": "ow",
  "55": "le",
  "56": "▁is",
  "57": "et",
  "58": "ent",
  "59": "ot",
  "60": "ut",
  "61": "▁re",
  "62": "▁on",
  "63": "ay",
  "64": "▁ha",
  "65": "ig",
  "66": "▁so",
  "67": "ct",
  "68": "▁he",
  "69": "▁for",
  "70": "ver",
  "71": "ke",
  "72": "ro",
  "73": "▁st",
  "74": "id",
  "75": "▁go",
  "76": "all",
  "77": "se",
  "78": "ly",
  "79": "▁u",
  "80": "ch",
  "81": "st",
  "82": "ld",
  "83": "▁k",
  "84": "ce",
  "85": "ur",
  "86": "▁li",
  "87": "am",
  "88": "▁r",
  "89": "ht",
  "90": "▁j",
  "91": "ith",
  "92": "▁se",
  "93": "ir",
  "94": "▁as",
  "95": "▁an",
  "96": "im",
  "97": "▁do",
  "98": "ad",
  "99": "▁was",
  "100": "ight",
  "101": "th",
  "102": "▁are",
  "103": "▁but",
  "104": "▁sh",
  "105": "ust",
  "106": "ally",
  "107": "▁not",
  "108": "▁or",
  "109": "▁com",
  "110": "▁can",
  "111": "▁me",
  "112": "op",
  "113": "▁mo",
  "114": "▁at",
  "115": "ill",
  "116": "▁ch",
  "117": "▁ne",
  "118": "ant",
  "119": "▁de",
  "120": "▁kn",
  "121": "▁one",
  "122": "il",
  "123": "ol",
  "124": "▁con",
  "125": "ter",
  "126": "▁ab",
  "127": "▁fr",
  "128": "ere",
  "129": "ck",
  "130": "▁al",
  "131": "▁all",
  "132": "qu",
  "133": "▁pro",
  "134": "▁som",
  "135": "ould",
  "136": "▁tw",
  "137": "ul",
  "138": "ra",
  "139": "od",
  "140": "ers",
  "141": "▁su",
  "142": "ive",
  "143": "▁v",
  "144": "use",
  "145": "ate",
  "146": "ge",
  "147": "if",
  "148": "▁ex",
  "149": "ess",
  "150": "pp",
  "151": "▁lo",
  "152": "out",
  "153": "▁if",
  "154": "est",
  "155": "ain",
  "156": "ist",
  "157": "and",
  "158": "ea",
  "159": "very",
  "160": "art",
  "161": "▁wor",
  "162": "▁my",
  "163": "ab",
  "164": "ment",
  "165": "▁bec",
  "166": "un",
  "167": "ity",
  "168": "ri",
  "169": "pe",
  "170": "ions",
  "171": "▁by",
  "172": "ok",
  "173": "our",
  "174": "ort",
  "175": "ind",
  "176": "ink",
  "177": "nt",
  "178": "▁up",
  "179": "um",
  "180": "▁don",
  "181": "▁get",
  "182": "red",
  "183": "▁out",
  "184": "el",
  "185": "ause",
  "186": "res",
  "187": "▁ma",
  "188": "ich",
  "189": "▁us",
  "190": "rou",
  "191": "▁int",
  "192": "em",
  "193": "os",
  "194": "ies",
  "195": "ie",
  "196": "▁pl",
  "197": "▁tr",
  "198": "ven",
  "199": "ous",
  "200": "▁le",
  "201": "▁two",
  "202": "ard",
  "203": "ine",
  "204": "▁co",
  "205": "een",
  "206": "▁now",
  "207": "ty",
  "208": "her",
  "209": "ack",
  "210": "▁pe",
  "211": "ame",
  "212": "▁how",
  "213": "▁who",
  "214": "▁see",
  "215": "▁tim",
  "216": "ect",
  "217": "ast",
  "218": "▁our",
  "219": "ci",
  "220": "ree",
  "221": "ople",
  "222": "gh",
  "223": "▁no",
  "224": "▁had",
  "225": "▁man",
  "226": "▁qu",
  "227": "▁en",
  "228": "ide",
  "229": "ure",
  "230": "ud",
  "231": "so",
  "232": "▁his",
  "233": "▁sa",
  "234": "▁sp",
  "235": "▁say",
  "236": "ose",
  "237": "ther",
  "238": "▁act",
  "239": "▁ta",
  "240": "▁cl",
  "241": "ings",
  "242": "pt",
  "243": "king",
  "244": "▁any",
  "245": "▁has",
  "246": "▁un",
  "247": "iv",
  "248": "▁im",
  "249": "▁ag",
  "250": "▁te",
  "251": "▁fe",
  "252": "one",
  "253": "per",
  "254": "ong",
  "255": "▁po",
  "256": "▁ad",
  "257": "ff",
  "258": "ore",
  "259": "itt",
  "260": "ans",
  "261": "iz",
  "262": "eah",
  "263": "reat",
  "264": "act",
  "265": "own",
  "266": "hing",
  "267": "enty",
  "268": "age",
  "269": "ber",
  "270": "ice",
  "271": "▁am",
  "272": "ple",
  "273": "are",
  "274": "▁per",
  "275": "und",
  "276": "ite",
  "277": "ix",
  "278": "pl",
  "279": "▁way",
  "280": "▁did",
  "281": "▁pr",
  "282": "▁got",
  "283": "ars",
  "284": "▁she",
  "285": "▁let",
  "286": "ag",
  "287": "▁ac",
  "288": "int",
  "289": "▁ar",
  "290": "ry",
  "291": "ign",
  "292": "ish",
  "293": "▁fir",
  "294": "ace",
  "295": "ble",
  "296": "og",
  "297": "ue",
  "298": "▁ye",
  "299": "ap",
  "300": "iff",
  "301": "▁ro",
  "302": "▁her",
  "303": "nder",
  "304": "▁ok",
  "305": "▁res",
  "306": "▁gu",
  "307": "ence",
  "308": "▁may",
  "309": "ated",
  "310": "ip",
  "311": "▁bo",
  "312": "▁him",
  "313": "way",
  "314": "ac",
  "315": "ical",
  "316": "ass",
  "317": "ase",
  "318": "▁dis",
  "319": "able",
  "320": "ick",
  "321": "▁app",
  "322": "ance",
  "323": "▁pre",
  "324": "▁six",
  "325": "▁off",
  "326": "▁new",
  "327": "ia",
  "328": "orm",
  "329": "ank",
  "330": "▁lot",
  "331": "ach",
  "332": "▁fo",
  "333": "inet",
  "334": "ire",
  "335": "ary",
  "336": "ult",
  "337": "▁tal",
  "338": "▁mu",
  "339": "▁bl",
  "340": "ount",
  "341": "sel",
  "342": "vel",
  "343": "▁br",
  "344": "▁imp",
  "345": "ep",
  "346": "cess",
  "347": "ord",
  "348": "▁sc",
  "349": "▁inc",
  "350": "ound",
  "351": "ang",
  "352": "be",
  "353": "ress",
  "354": "uct",
  "355": "▁ind",
  "356": "▁af",
  "357": "ving",
  "358": "▁oh",
  "359": "▁bet",
  "360": "▁use",
  "361": "ome",
  "362": "ens",
  "363": "ys",
  "364": "▁bu",
  "365": "co",
  "366": "ory",
  "367": "ater",
  "368": "ild",
  "369": "ght",
  "370": "ial",
  "371": "▁day",
  "372": "ning",
  "373": "na",
  "374": "ile",
  "375": "▁spe",
  "376": "▁mar",
  "377": "ody",
  "378": "ough",
  "379": "ade",
  "380": "vers",
  "381": "xt",
  "382": "▁fl",
  "383": "▁ke",
  "384": "ian",
  "385": "▁sy",
  "386": "▁put",
  "387": "fore",
  "388": "ub",
  "389": "▁ph",
  "390": "fe",
  "391": "▁em",
  "392": "▁ser",
  "393": "form",
  "394": "ting",
  "395": "te",
  "396": "av",
  "397": "ious",
  "398": "▁rec",
  "399": "ks",
  "400": "▁gr",
  "401": "ces",
  "402": "wn",
  "403": "ors",
  "404": "▁jo",
  "405": "ents",
  "406": "▁des",
  "407": "▁try",
  "408": "▁equ",
  "409": "▁z",
  "410": "▁rem",
  "411": "▁str",
  "412": "self",
  "413": "▁bit",
  "414": "ph",
  "415": "ved",
  "416": "▁why",
  "417": "▁bas",
  "418": "▁hel",
  "419": "▁rel",
  "420": "ath",
  "421": "ject",
  "422": "ail",
  "423": "▁la",
  "424": "ual",
  "425": "▁god",
  "426": "▁nat",
  "427": "erm",
  "428": "day",
  "429": "▁id",
  "430": "ft",
  "431": "▁wr",
  "432": "▁min",
  "433": "ates",
  "434": "▁gen",
  "435": "tain",
  "436": "▁ob",
  "437": "ull",
  "438": "ict",
  "439": "▁tra",
  "440": "▁end",
  "441": "▁hig",
  "442": "▁fif",
  "443": "oth",
  "444": "tern",
  "445": "▁its",
  "446": "vent",
  "447": "▁sm",
  "448": "ons",
  "449": "▁add",
  "450": "iss",
  "451": "▁bel",
  "452": "ful",
  "453": "get",
  "454": "▁ele",
  "455": "▁rep",
  "456": "ak",
  "457": "▁ho",
  "458": "▁pos",
  "459": "▁num",
  "460": "ange",
  "461": "ves",
  "462": "ific",
  "463": "urn",
  "464": "ise",
  "465": "▁cr",
  "466": "▁um",
  "467": "ward",
  "468": "▁reg",
  "469": "ady",
  "470": "ower",
  "471": "uc",
  "472": "▁dec",
  "473": "lic",
  "474": "▁set",
  "475": "▁gon",
  "476": "▁op",
  "477": "▁ear",
  "478": "▁sub",
  "479": "▁sl",
  "480": "les",
  "481": "stem",
  "482": "cial",
  "483": "olog",
  "484": "atch",
  "485": "ily",
  "486": "body",
  "487": "nds",
  "488": "ular",
  "489": "ren",
  "490": "▁own",
  "491": "▁too",
  "492": "cent",
  "493": "ible",
  "494": "pect",
  "495": "ered",
  "496": "ways",
  "497": "teen",
  "498": "▁uh",
  "499": "▁big",
  "500": "▁mod",
  "501": "▁att",
  "502": "▁car",
  "503": "gr",
  "504": "▁acc",
  "505": "ied",
  "506": "mun",
  "507": "ib",
  "508": "▁mon",
  "509": "▁sch",
  "510": "▁pol",
  "511": "▁dat",
  "512": "▁fin",
  "513": "▁sim",
  "514": "▁inv",
  "515": "▁def",
  "516": "ked",
  "517": "▁ent",
  "518": "▁yes",
  "519": "ows",
  "520": "ics",
  "521": "ited",
  "522": "ute",
  "523": "ism",
  "524": "ps",
  "525": "▁ed",
  "526": "▁el",
  "527": "ably",
  "528": "ppen",
  "529": "als",
  "530": "▁ten",
  "531": "ract",
  "532": "ss",
  "533": "▁ass",
  "534": "▁met",
  "535": "gan",
  "536": "▁eng",
  "537": "▁stu",
  "538": "ween",
  "539": "arch",
  "540": "▁gl",
  "541": "▁cor",
  "542": "▁dr",
  "543": "vern",
  "544": "▁ty",
  "545": "▁run",
  "546": "hip",
  "547": "cus",
  "548": "cond",
  "549": "▁ins",
  "550": "irty",
  "551": "▁pub",
  "552": "lud",
  "553": "llow",
  "554": "▁cou",
  "555": "ew",
  "556": "iew",
  "557": "▁sur",
  "558": "ero",
  "559": "ood",
  "560": "ness",
  "561": "▁fun",
  "562": "▁eff",
  "563": "cept",
  "564": "▁ca",
  "565": "▁exp",
  "566": "duct",
  "567": "▁sw",
  "568": "ize",
  "569": "ope",
  "570": "▁par",
  "571": "kes",
  "572": "cy",
  "573": "▁ev",
  "574": "▁ref",
  "575": "ell",
  "576": "▁bus",
  "577": "ug",
  "578": "rib",
  "579": "▁cur",
  "580": "mo",
  "581": "ock",
  "582": "ures",
  "583": "air",
  "584": "▁war",
  "585": "str",
  "586": "▁med",
  "587": "▁wa",
  "588": "▁val",
  "589": "▁sin",
  "590": "blem",
  "591": "▁fam",
  "592": "li",
  "593": "▁far",
  "594": "▁cle",
  "595": "▁col",
  "596": "mon",
  "597": "▁gra",
  "598": "led",
  "599": "ense",
  "600": "tin",
  "601": "ues",
  "602": "its",
  "603": "▁mem",
  "604": "▁inf",
  "605": "▁eas",
  "606": "ideo",
  "607": "▁top",
  "608": "io",
  "609": "pan",
  "610": "▁hum",
  "611": "▁old",
  "612": "ead",
  "613": "▁ord",
  "614": "ric",
  "615": "ants",
  "616": "oy",
  "617": "esn",
  "618": "uck",
  "619": "ason",
  "620": "ced",
  "621": "ool",
  "622": "rat",
  "623": "ouse",
  "624": "▁lar",
  "625": "▁art",
  "626": "▁wee",
  "627": "▁cer",
  "628": "ized",
  "629": "▁mat",
  "630": "con",
  "631": "erg",
  "632": "land",
  "633": "ines",
  "634": "▁chr",
  "635": "▁aut",
  "636": "▁lea",
  "637": "▁sou",
  "638": "oney",
  "639": "tty",
  "640": "▁ple",
  "641": "ulat",
  "642": "oks",
  "643": "▁few",
  "644": "▁sol",
  "645": "▁che",
  "646": "chn",
  "647": "ird",
  "648": "▁bre",
  "649": "▁dur",
  "650": "▁wom",
  "651": "me",
  "652": "izat",
  "653": "eric",
  "654": "ote",
  "655": "▁uni",
  "656": "eren",
  "657": "arn",
  "658": "ross",
  "659": "ices",
  "660": "ten",
  "661": "eral",
  "662": "ever",
  "663": "ieve",
  "664": "lish",
  "665": "ash",
  "666": "▁opp",
  "667": "alth",
  "668": "ger",
  "669": "▁sk",
  "670": "▁red",
  "671": "peri",
  "672": "▁det",
  "673": "▁ext",
  "674": "ner",
  "675": "ah",
  "676": "▁var",
  "677": "▁loc",
  "678": "gram",
  "679": "ists",
  "680": "ives",
  "681": "▁es",
  "682": "▁nor",
  "683": "tro",
  "684": "ale",
  "685": "▁iss",
  "686": "▁pri",
  "687": "gin",
  "688": "az",
  "689": "oc",
  "690": "▁pop",
  "691": "ern",
  "692": "▁sit",
  "693": "ket",
  "694": "▁pa",
  "695": "▁law",
  "696": "ages",
  "697": "br",
  "698": "▁cam",
  "699": "▁mom",
  "700": "osed",
  "701": "▁bro",
  "702": "ne",
  "703": "bs",
  "704": "▁cre",
  "705": "erat",
  "706": "▁sec",
  "707": "▁cap",
  "708": "▁vis",
  "709": "▁pat",
  "710": "ield",
  "711": "iet",
  "712": "▁tri",
  "713": "up",
  "714": "▁bra",
  "715": "ts",
  "716": "▁mot",
  "717": "▁unt",
  "718": "put",
  "719": "bo",
  "720": "ork",
  "721": "mer",
  "722": "ital",
  "723": "▁air",
  "724": "ined",
  "725": "▁beh",
  "726": "▁adv",
  "727": "▁ret",
  "728": "imes",
  "729": "▁tea",
  "730": "ural",
  "731": "sid",
  "732": "ters",
  "733": "▁pur",
  "734": "▁sci",
  "735": "bers",
  "736": "ient",
  "737": "ier",
  "738": "cc",
  "739": "sw",
  "740": "▁av",
  "741": "reen",
  "742": "ode",
  "743": "ont",
  "744": "▁dra",
  "745": "ann",
  "746": "nect",
  "747": "▁x",
  "748": "▁eu",
  "749": "ton",
  "750": "inat",
  "751": "ene",
  "752": "ared",
  "753": "els",
  "754": "▁mor",
  "755": "▁rat",
  "756": "cri",
  "757": "▁men",
  "758": "▁ah",
  "759": "ames",
  "760": "▁arm",
  "761": "eak",
  "762": "▁pay",
  "763": "▁hal",
  "764": "ins",
  "765": "ilit",
  "766": "stit",
  "767": "▁ra",
  "768": "▁leg",
  "769": "cl",
  "770": "pr",
  "771": "▁wal",
  "772": "▁bad",
  "773": "▁ge",
  "774": "roup",
  "775": "▁mus",
  "776": "man",
  "777": "▁gi",
  "778": "eds",
  "779": "▁aw",
  "780": "po",
  "781": "ark",
  "782": "row",
  "783": "▁dep",
  "784": "ully",
  "785": "ral",
  "786": "lect",
  "787": "pend",
  "788": "▁sev",
  "789": "ime",
  "790": "gest",
  "791": "here",
  "792": "▁yet",
  "793": "ted",
  "794": "▁rev",
  "795": "ds",
  "796": "▁ask",
  "797": "less",
  "798": "▁di",
  "799": "ets",
  "800": "line",
  "801": "▁aff",
  "802": "ired",
  "803": "▁est",
  "804": "ken",
  "805": "vid",
  "806": "most",
  "807": "ivid",
  "808": "unch",
  "809": "par",
  "810": "med",
  "811": "rop",
  "812": "ased",
  "813": "eone",
  "814": "▁ve",
  "815": "▁abs",
  "816": "ergy",
  "817": "ret",
  "818": "▁saw",
  "819": "▁ey",
  "820": "▁cal",
  "821": "uat",
  "822": "▁mid",
  "823": "vat",
  "824": "ream",
  "825": "vice",
  "826": "ians",
  "827": "rent",
  "828": "ctor",
  "829": "err",
  "830": "ush",
  "831": "ases",
  "832": "▁suc",
  "833": "erms",
  "834": "ave",
  "835": "angu",
  "836": "ries",
  "837": "▁wo",
  "838": "arts",
  "839": "▁fil",
  "840": "▁fat",
  "841": "▁cho",
  "842": "orts",
  "843": "▁fre",
  "844": "ee",
  "845": "ught",
  "846": "eng",
  "847": "ump",
  "848": "▁bar",
  "849": "ying",
  "850": "ane",
  "851": "▁tem",
  "852": "anks",
  "853": "ury",
  "854": "iat",
  "855": "mit",
  "856": "trol",
  "857": "▁net",
  "858": "▁maj",
  "859": "▁cra",
  "860": "ling",
  "861": "▁fig",
  "862": "orn",
  "863": "icat",
  "864": "pany",
  "865": "▁occ",
  "866": "ott",
  "867": "ands",
  "868": "▁exc",
  "869": "▁mr",
  "870": "ency",
  "871": "rope",
  "872": "itch",
  "873": "▁lit",
  "874": "abil",
  "875": "not",
  "876": "ma",
  "877": "▁typ",
  "878": "▁opt",
  "879": "ob",
  "880": "ser",
  "881": "ety",
  "882": "ms",
  "883": "peci",
  "884": "aces",
  "885": "aut",
  "886": "▁hon",
  "887": "cuss",
  "888": "▁sal",
  "889": "▁sor",
  "890": "att",
  "891": "▁lab",
  "892": "▁har",
  "893": "urch",
  "894": "nded",
  "895": "uce",
  "896": "ids",
  "897": "▁hy",
  "898": "▁fut",
  "899": "▁ste",
  "900": "ours",
  "901": "ems",
  "902": "utes",
  "903": "ng",
  "904": "ta",
  "905": "▁won",
  "906": "▁fa",
  "907": "▁env",
  "908": "ards",
  "909": "▁job",
  "910": "ium",
  "911": "▁dot",
  "912": "▁obv",
  "913": "ina",
  "914": "side",
  "915": "elve",
  "916": "cu",
  "917": "▁jes",
  "918": "▁pot",
  "919": "▁pie",
  "920": "▁tre",
  "921": "▁hey",
  "922": "▁mag",
  "923": "ron",
  "924": "▁key",
  "925": "swer",
  "926": "▁win",
  "927": "ucat",
  "928": "work",
  "929": "ides",
  "930": "▁low",
  "931": "▁vol",
  "932": "▁oth",
  "933": "atic",
  "934": "lf",
  "935": "ads",
  "936": "inds",
  "937": "com",
  "938": "ths",
  "939": "▁ver",
  "940": "ised",
  "941": "lo",
  "942": "▁squ",
  "943": "▁cut",
  "944": "oked",
  "945": "irit",
  "946": "ateg",
  "947": "ppy",
  "948": "mitt",
  "949": "come",
  "950": "hn",
  "951": "igin",
  "952": "mand",
  "953": "▁dam",
  "954": "ho",
  "955": "▁da",
  "956": "▁fur",
  "957": "iron",
  "958": "ilar",
  "959": "▁fac",
  "960": "▁neg",
  "961": "▁ago",
  "962": "ged",
  "963": "miss",
  "964": "enth",
  "965": "▁dou",
  "966": "▁hit",
  "967": "▁guy",
  "968": "▁bi",
  "969": "ove",
  "970": "fess",
  "971": "ples",
  "972": "owed",
  "973": "ured",
  "974": "▁ris",
  "975": "ints",
  "976": "rew",
  "977": "▁sum",
  "978": "▁hu",
  "979": "ploy",
  "980": "ude",
  "981": "ried",
  "982": "▁cir",
  "983": "▁dev",
  "984": "ear",
  "985": "▁tot",
  "986": "▁ann",
  "987": "duc",
  "988": "ik",
  "989": "pon",
  "990": "sted",
  "991": "▁ide",
  "992": "▁'",
  "993": "ipp",
  "994": "▁eat",
  "995": "▁dom",
  "996": "▁",
  "997": "e",
  "998": "t",
  "999": "o",
  "1000": "a",
  "1001": "i",
  "1002": "n",
  "1003": "s",
  "1004": "r",
  "1005": "h",
  "1006": "l",
  "1007": "d",
  "1008": "u",
  "1009": "c",
  "1010": "m",
  "1011": "y",
  "1012": "g",
  "1013": "w",
  "1014": "f",
  "1015": "p",
  "1016": "b",
  "1017": "v",
  "1018": "k",
  "1019": "'",
  "1020": "j",
  "1021": "x",
  "1022": "q",
  "1023": "z",
  "1024": "<EOU>",
  "1025": "<EOB>"
}